[{
  "_id": {
    "$oid": "662403d3c94f92caf7fcff1a"
  },
  "name": "Argylle",
  "rating": "2.9",
  "video": "https://www.youtube.com/embed/7mgu9mNZ8Hk",
  "release": "2024",
  "director": "Matthew Vaughn",
  "info": "From the twisted mind of Matthew Vaughn (Kingsman franchise, Kick-Ass) comes Argylle, a razor-witted, reality-bending, globe-encircling spy thriller.<br>Bryce Dallas Howard (Jurassic World franchise) is Elly Conway, the reclusive author of a series of best-selling espionage novels, whose idea of bliss is a night at home with her computer and her cat, Alfie. But when the plots of Elly’s fictional books—which center on secret agent Argylle and his mission to unravel a global spy syndicate—begin to mirror the covert actions of a real-life spy organization, quiet evenings at home become a thing of the past.<br>The top-flight ensemble cast features Henry Cavill (The Witcher), John Cena (Fast X), Oscar® winner Ariana DeBose (West Side Story), Grammy winning pop superstar Dua Lipa (Barbie), Emmy winner and Oscar® nominee Bryan Cranston (Breaking Bad), Emmy winner and comedy icon Catherine O’Hara (Schitt’s Creek), Sofia Boutella (Kingsman: The Secret Service), and the legendary Samuel L. Jackson. Alfie is played by Chip, the real-life cat of supermodel Claudia Vaughn (née Schiffer)."
},
{
  "_id": {
    "$oid": "66241892c94f92caf7fcff1c"
  },
  "name": "Dune_2",
  "rating": "4.4",
  "video": "https://www.youtube.com/embed/U2Qp5pL3ovA",
  "release": "2024",
  "director": "Villeneuve",
  "info": "The saga continues as award-winning filmmaker Denis Villeneuve embarks on “Dune: Part Two,” the next chapter of Frank Herbert’s celebrated novel Dune, with an expanded all-star international ensemble cast. The film, from Warner Bros. Pictures and Legendary Pictures, is the highly anticipated follow-up to 2021’s six-time Academy Award-winning “Dune.”<br>The big-screen epic continues the adaptation of Frank Herbert’s acclaimed bestseller Dune with returning and new stars, including Oscar nominee Timothée Chalamet (“Wonka,” “Call Me by Your Name”), Zendaya (“Spider-Man: No Way Home,” “Malcolm & Marie,” “Euphoria”), Rebecca Ferguson (“Mission: Impossible – Dead Reckoning”), Oscar nominee Josh Brolin (“Avengers: End Game,” “Milk”), Oscar nominee Austin Butler (“Elvis,” “Once Upon A Time…In Hollywood”), Oscar nominee Florence Pugh (“Black Widow,” “Little Women”), Dave Bautista (the “Guardians of the Galaxy” films, “Thor: Love and Thunder”), Oscar winner Christopher Walken (“The Deer Hunter,” “Hairspray”), Léa Seydoux (the “James Bond” franchise and “Crimes of the Future”), Souheila Yacoub (“The Braves,” “Climax”), with Stellan Skarsgård (the “Mamma Mia!” films, “Avengers: Age of Ultron”), with Oscar nominee Charlotte Rampling (“45 Years,” “Assassin’s Creed”), and Oscar winner Javier Bardem (“No Country for Old Men,” “Being the Ricardos”).<br> “Dune: Part Two” will explore the mythic journey of Paul Atreides as he unites with Chani and the Fremen while on a path of revenge against the conspirators who destroyed his family. Facing a choice between the love of his life and the fate of the known universe, he endeavors to prevent a terrible future only he can foresee."
},
{
  "_id": {
    "$oid": "662419e0c94f92caf7fcff1d"
  },
  "name": "Kung_Fu_Panda_4",
  "rating": "3.2",
  "video": "https://www.youtube.com/embed/_inKs4eeHiI",
  "release": "2024",
  "director": "Mike Mitchell",
  "info": "This spring, for the first time in almost a decade, comedy icon Jack Black returns to his role as Po, the world’s most unlikely kung fu master, with a hilarious, butt-kicking new chapter in DreamWorks Animation’s beloved action-comedy franchise: Kung Fu Panda 4. <br> After three death-defying adventures defeating world-class villains with his unmatched courage and mad martial arts skills, Po, the Dragon Warrior (Golden Globe nominee Jack Black), is called upon by destiny to … give it a rest already. More specifically, he’s tapped to become the Spiritual Leader of the Valley of Peace.<br>That poses a couple of obvious problems. First, Po knows as much about spiritual leadership as he does about the paleo diet, and second, he needs to quickly find and train a new Dragon Warrior before he can assume his new lofty position. <br>Even worse, there’s been a recent sighting of a wicked, powerful sorceress, Chameleon (Oscar® winner Viola Davis), a tiny lizard who can shapeshift into any creature, large or small. And Chameleon has her greedy, beady little eyes on Po’s Staff of Wisdom, which would give her the power to re-summon all the master villains whom Po has vanquished to the spirit realm. "
},
{
  "_id": {
    "$oid": "66241a5bc94f92caf7fcff1e"
  },
  "name": "Godzilla_X_Kong",
  "rating": "3.3",
  "video": "https://www.youtube.com/embed/lV1OOlGwExM",
  "release": "2024",
  "director": "Adam Wingard",
  "info": "The epic battle continues!  Legendary Pictures’ cinematic Monsterverse follows up the explosive showdown of “Godzilla vs. Kong” with an all-new adventure that pits the almighty Kong and the fearsome Godzilla against a colossal undiscovered threat hidden within our world, challenging their very existence—and our own. “Godzilla x Kong: The New Empire” delves further into the histories of these Titans and their origins, as well as the mysteries of Skull Island and beyond, while uncovering the mythic battle that helped forge these extraordinary beings and tied them to humankind forever.<br>Once again at the helm is director Adam Wingard.  The film stars Rebecca Hall (“Godzilla vs. Kong,” The Night House”), Brian Tyree Henry (“Godzilla vs. Kong,” “Bullet Train”), Dan Stevens (“Gaslit,” “Legion,” “Beauty and the Beast”), Kaylee Hottle (“Godzilla vs. Kong”), Alex Ferns (“The Batman,” “Wrath of Man,” “Chernobyl”) and Fala Chen (“Irma Vep,” “Shang Chi and the Legend of the Ten Rings”).<br>The screenplay is by Terry Rossio (“Godzilla vs. Kong” the “Pirates of the Caribbean” series) and Simon Barrett (“You’re Next”) and Jeremy Slater (“Moon Knight”), from a story by Rossio & Wingard & Barrett, based on the character “Godzilla” owned and created by TOHO Co., Ltd..  The film is produced by Mary Parent, Alex Garcia, Eric Mcleod, Thomas Tull, Jon Jashni and Brian Rogers.  The executive producers are Wingard, Jen Conroy, Jay Ashenfelter, Yoshimitsu Banno, Kenji Okuhira. "
},
{
  "_id": {
    "$oid": "662d4bbbe23ea11b5ce34f2e"
  },
  "name": "Napoleon",
  "rating": "3.2",
  "video": "https://www.youtube.com/embed/OAZWXUkrjPc",
  "release": "2023",
  "director": "Ridley Scott",
  "info": "Napoleon is a spectacle-filled action epic that details the checkered rise and fall of the iconic French Emperor Napoleon Bonaparte, played by Oscar®-winner Joaquin Phoenix. Against a stunning backdrop of large-scale filmmaking orchestrated by legendary director Ridley Scott, the film captures Bonaparte's relentless journey to power through the prism of his addictive, volatile relationship with his one true love, Josephine, showcasing his visionary military and political tactics against some of the most dynamic practical battle sequences ever film"
},
{
  "_id": {
    "$oid": "662defd9a0b9f6fcde8bbfaf"
  },
  "name": "No_Way_Up",
  "rating": "2.3",
  "video": "https://www.youtube.com/embed/e1k1PC0TtmE",
  "release": "2024",
  "director": " Claudio Fäh",
  "info": "NO WAY UP is a high concept combination of disaster movie and survival thriller, as characters from very different backgrounds are thrown together when the plane they’re travelling on crashes into the Pacific Ocean.\r\n\r\nThe stricken airliner comes to rest perilously close to the edge of a bottomless ravine with the surviving passengers and crew trapped in an air pocket. With their air supply rapidly running out, a nightmare fight for survival ensues as dangers from all sides hone-in on them"
},
{
  "_id": {
    "$oid": "662df0c5a0b9f6fcde8bbfb0"
  },
  "name": "Alienoid",
  "rating": "3.1",
  "video": "https://www.youtube.com/embed/JaRLlh8Pw5A",
  "release": "2022",
  "director": "Choi Dong-hoon",
  "info": "Gurus in the late Goryeo dynasty try to obtain a fabled, holy sword, and humans in 2022 hunt down an alien prisoner that is locked in a human's body. The two parties cross paths when a time-traveling portal opens up."
},
{
  "_id": {
    "$oid": "662df184a0b9f6fcde8bbfb1"
  },
  "name": "Anyone_But_You",
  "rating": "6.2",
  "video": "https://www.youtube.com/embed/hXr6Q9-Fi2A",
  "release": "2023",
  "director": "Will Gluck",
  "info": "In the edgy comedy Anyone But You, Bea (Sydney Sweeney) and Ben (Glen Powell) look like the perfect couple, but after an amazing first date something happens that turns their fiery hot attraction ice cold - until they find themselves unexpectedly thrust together at a destination wedding in Australia. So they do what any two mature adults would do: pretend to be a couple.\r\n\r\nDirected by: Will Gluck\r\n\r\nStory by: Ilana Wolpert\r\n\r\nScreenplay by: Ilana Wolpert and Will Gluck\r\n"
},
{
  "_id": {
    "$oid": "662df21ea0b9f6fcde8bbfb2"
  },
  "name": "Arthur_the_King",
  "rating": "3.6",
  "video": "https://www.youtube.com/embed/wjDJNEPghNY",
  "release": "2024",
  "director": "Simon Cellan Jones",
  "info": "Over the course of ten days and 435 miles, an unbreakable bond is forged between pro adventure racer Michael Light (Mark Wahlberg) and a scrappy street dog companion dubbed Arthur. Based on an incredible true story, ARTHUR THE KING follows Light, desperate for one last chance to win, as he convinces a sponsor to back him and a team of athletes (Simu Liu, Nathalie Emmanuel, and Ali Suliman) for the Adventure Racing World Championship in the Dominican Republic. As the team is pushed to their outer limits of endurance in the race, Arthur redefines what victory, loyalty and friendship truly mean.\r\n\r\nLionsgate presents, in association with eOne, a Tucker Tooley Entertainment / Mark Canton / Municipal Pictures production."
},
{
  "_id": {
    "$oid": "662df26da0b9f6fcde8bbfb3"
  },
  "name": "Becoming",
  "rating": "2.4",
  "video": "https://www.youtube.com/embed/qoHmsJhsfpc",
  "release": "2020",
  "director": "Omar Naim",
  "info": "The life of a young woman turns upside down when she realises that her fiance is possessed by an evil entity that is a threat to everyone around it."
},
{
  "_id": {
    "$oid": "662df3807d8dd8f8df3ab3b6"
  },
  "name": "Bohemian_Rhapsody",
  "rating": "4.0",
  "video": "https://www.youtube.com/embed/BQtkAjwN5RI",
  "release": " 2018",
  "director": " Bryan Singer",
  "info": "Bohemian Rhapsody is a foot-stomping celebration of Queen, their music and their extraordinary lead singer Freddie Mercury. Freddie defied stereotypes and shattered convention to become one of the most beloved entertainers on the planet. \r\n\r\nThe film traces the meteoric rise of the band through their iconic songs and revolutionary sound. They reach unparalleled success, but in an unexpected turn Freddie, surrounded by darker influences, shuns Queen in pursuit of his solo career. Having suffered greatly without the collaboration of Queen, Freddie manages to reunite with his bandmates just in time for Live Aid. While bravely facing a recent AIDS diagnosis, Freddie leads the band in one of the greatest performances in the history of rock music. Queen cements a legacy that continues to inspire outsiders, dreamers and music lovers to this day.\r\n\r\nCast: Rami Malek, Lucy Boynton, Gwilym Lee, Ben Hardy, Joseph Mazzello, Aidan Gillen, Tom Hollander, Allen Leech and Mike Myers."
},
{
  "_id": {
    "$oid": "662df47a7d8dd8f8df3ab3b7"
  },
  "name": "Breathe",
  "rating": "1.8",
  "video": "https://www.youtube.com/embed/chaHsowROfQ",
  "release": "2024",
  "director": "Stefon Bristol",
  "info": "Breathe is a heart pounding thriller set in the future.  After Earth is left uninhabitable due to lack of oxygen, a mother Maya (Jennifer Hudson) and her daughter Zora (Quvenzhané Wallis) are forced to live underground, with short trips to the surface only made possible by a coveted state of the art oxygen suit made by Maya’s husband, Darius, whom she presumes to be dead. When a mysterious couple arrives claiming to know Darius and his fate, Maya tentatively agrees to let them into their bunker but these visitors are not who they claim to be ensuing in mother and daughter fighting for survival. IN THEATERS AND ON DIGITAL: April 26, 2024\r\n"
},
{
  "_id": {
    "$oid": "662df4e47d8dd8f8df3ab3b8"
  },
  "name": "Civil_War",
  "rating": "3.8",
  "video": "https://www.youtube.com/embed/c2G18nIVpNE",
  "release": "2024",
  "director": "Alex Garland",
  "info": "In a dystopian future America, a team of military-embedded journalists races against time to reach Washington, D.C., before rebel factions descend upon the White House."
},
{
  "_id": {
    "$oid": "662df5267d8dd8f8df3ab3b9"
  },
  "name": "Coco",
  "rating": "4.2",
  "video": "https://www.youtube.com/embed/Rvr68u6k5sI",
  "release": "2017",
  "director": " Adrian Molina",
  "info": "Despite his family’s baffling generations-old ban on music, Miguel (voice of newcomer Anthony Gonzalez) dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz (voice of Benjamin Bratt). Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector (voice of Gael García Bernal), and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history. Directed by Lee Unkrich, co-directed by Adrian Molina and produced by Darla K. Anderson, Disney•Pixar’s “Coco” opens in U.S. theaters on Nov. 22, 2017."
},
{
  "_id": {
    "$oid": "662df5977d8dd8f8df3ab3ba"
  },
  "name": "Damaged",
  "rating": "2.3",
  "video": "https://www.youtube.com/embed/Sg8NuJL5P_8",
  "release": "2024",
  "director": "Terry McDonough",
  "info": "How do you catch a brilliant monster? When a sadistic murderer surfaces in Scotland, terrified local authorities call on a Chicago police detective who investigated a killing spree with the same horrific pattern five years earlier. Samuel L. Jackson and Vincent Cassel star in this shocking thriller about two detectives with tortured pasts trying to stop a merciless serial killer before he claims his next victim.\r\n"
},
{
  "_id": {
    "$oid": "662df5d67d8dd8f8df3ab3bb"
  },
  "name": "Damsel",
  "rating": "3.2",
  "video": "https://www.youtube.com/embed/iM150ZWovZM",
  "release": "2024",
  "director": "Juan Carlos Fresnadillo",
  "info": "A dutiful damsel agrees to marry a handsome prince, only to find the royal family has recruited her as a sacrifice to repay an ancient debt. Thrown into a cave with a fire-breathing dragon, she must rely on her wits and will to survive. Millie Bobby Brown stars in Damsel. Only on Netflix, Mar 8, 2024."
},
{
  "_id": {
    "$oid": "662df6207d8dd8f8df3ab3bc"
  },
  "name": "Dead_Boy_Detectives",
  "rating": "3.7",
  "video": "https://www.youtube.com/embed/hwJmZ2Ekfbc",
  "release": "2024",
  "director": "Matt Wagner",
  "info": "Edwin and Charles are best friends, ghosts… and the best detectives on the Mortal plane. They will do anything to stick together – including escaping evil witches, Hell and Death herself. With the help of a clairvoyant named Crystal and her friend Niko, they are able to crack some of the mortal realm’s most mystifying paranormal cases.\r\n\r\n"
},
{
  "_id": {
    "$oid": "662df66e7d8dd8f8df3ab3bd"
  },
  "name": "Death_Alley",
  "rating": "1.7",
  "video": "https://www.youtube.com/embed/VVX8j0kUBPs",
  "release": "2021",
  "director": "Nicholas Barton",
  "info": "In 1892, the Dalton Gang sets out to become famous by robbing two banks in one town on the same day. However, when the town's inhabitants decide to fight back, things start to unravel for the gang"
},
{
  "_id": {
    "$oid": "662df6a67d8dd8f8df3ab3be"
  },
  "name": "Descendants_3",
  "rating": "3.2",
  "video": "https://www.youtube.com/embed/8jpvcD_LkK4",
  "release": "2019",
  "director": "Kenny Ortega",
  "info": "Mal (Dove Cameron), Evie (Sofia Carson), Carlos (Cameron Boyce) and Jay (BooBoo Stewart) return to the Isle of the Lost to recruit a new batch of villainous offspring to join them at Auradon Prep.  When a barrier breach jeopardizes the safety of Auradon during their departure off the Isle, Mal resolves to permanently close the barrier, fearing that nemeses Uma (China Anne McClain) and Hades (Cheyenne Jackson) will wreak vengeance on the kingdom.  Despite her decision, an unfathomable dark force threatens the people of Auradon, and it's up to Mal and the VKs to save everyone in their most epic battle yet."
},
{
  "_id": {
    "$oid": "662df6ed7d8dd8f8df3ab3bf"
  },
  "name": "Django_Unchained",
  "rating": "4.3",
  "video": "https://www.youtube.com/embed/_iH0UBYDI4g",
  "release": "2013",
  "director": "Quentin Tarantino",
  "info": "Set in the South two years before the Civil War, DJANGO UNCHAINED stars Academy Award winner Jamie Foxx as Django, a slave whose brutal history with his former owners land s him face-to-face with german-born bounty hunter Dr. King Schultz (Academy Award winner Christoph Waltz). Schultz is on the trail of the muderous Brittle brothers, and only Django can lead him to his bounty. The unorthodox Schultz acquires Django with a promise to free him upon the capture of the Brittles - dead or alive."
},
{
  "_id": {
    "$oid": "662df7527d8dd8f8df3ab3c0"
  },
  "name": "Exhuma",
  "rating": "3.6",
  "video": "https://www.youtube.com/embed/H2O193v3jkM",
  "release": "2024",
  "director": "Jang Jae-hyun",
  "info": "Synopsis: When a renowned shaman (KIM Go-Eun) and her protégé (Lee Do-hyun) are hired by a wealthy, enigmatic family, they begin investigating the cause of a disturbing supernatural illness that affects only the first-born children of each generation. With the help of a knowledgeable mortician (YOO Hai-jin) and the country’s most revered geomancer (CHOI Min-sik), they soon trace the affliction’s origin to a long-hidden family grave located on sacred ground. Sensing an ominous aura surrounding the burial site, the team opts to exhume and relocate the ancestral remains immediately. But as something much darker emerges, they soon discover what befalls those who dare to mess with the wrong grave."
},
{
  "_id": {
    "$oid": "662df7967d8dd8f8df3ab3c1"
  },
  "name": "Fast_X",
  "rating": "2.9",
  "video": "https://www.youtube.com/embed/32RAq6JzY-w",
  "release": "2023",
  "director": "Louis Leterrier",
  "info": "Fast X, the tenth film in the Fast & Furious Saga, launches the final chapters of one of cinema’s most storied and popular global franchises, now in its third decade and still going strong with the same core cast and characters as when it began.\r\n\r\nOver many missions and against impossible odds, Dom Toretto (Vin Diesel) and his family have outsmarted, out-nerved and outdriven every foe in their path. Now, they confront the most lethal opponent they’ve ever faced: A terrifying threat emerging from the shadows of the past who’s fueled by blood revenge, and who is determined to shatter this family and destroy everything—and everyone—that Dom loves, forever.  \r\n \r\nIn 2011’s Fast Five, Dom and his crew took out nefarious Brazilian drug kingpin Hernan Reyes and decapitated his empire on a bridge in Rio De Janeiro. What they didn’t know was that Reyes’ son, Dante (Aquaman’s Jason Momoa), witnessed it all and has spent the last 12 years masterminding a plan to make Dom pay the ultimate price. \r\n \r\nDante’s plot will scatter Dom’s family from Los Angeles to the catacombs of Rome, from Brazil to London and from Portugal to Antarctica. New allies will be forged and old enemies will resurface. But everything changes when Dom discovers that his own 8-year-old son (Leo Abelo Perry, Black-ish) is the ultimate target of Dante’s vengeance. \r\n "
},
{
  "_id": {
    "$oid": "662df8257d8dd8f8df3ab3c2"
  },
  "name": "Fifty_Shades_of_Black",
  "rating": "1.8",
  "video": "https://www.youtube.com/embed/Xo0dfpdupOg",
  "release": "2016",
  "director": "Michael Tiddes",
  "info": "Hannah Steele meets Christian Black, a wealthy businessman, who introduces her to the world of BDSM. Despite being different, they begin an unusual relationship with each other."
},
{
  "_id": {
    "$oid": "662df8857d8dd8f8df3ab3c3"
  },
  "name": "Fighter",
  "rating": "3.1",
  "video": "https://www.youtube.com/embed/6amIq_mP4xM",
  "release": "2024",
  "director": "Siddharth Anand",
  "info": "Militant activities are going out of control in the Srinagar Valley, so a new and elite unit, Air Dragons, is commissioned by the Air Headquarters. They are now the first responders to any hostile activity. They comprise of the best combat aviators handpicked from across the IAF. FIGHTER is the story of Air Dragons who are willing to give it their all for the nation while going through the highs and lows of their internal and external battles."
},
{
  "_id": {
    "$oid": "662df8bb7d8dd8f8df3ab3c4"
  },
  "name": "Godzilla_x_kong_The_New_Empire",
  "rating": "3.3",
  "video": "https://www.youtube.com/embed/",
  "release": "2024",
  "director": "Adam Wingard",
  "info": "Godzilla and the almighty Kong face a colossal threat hidden deep within the planet, challenging their very existence and the survival of the human race."
},
{
  "_id": {
    "$oid": "662df8f47d8dd8f8df3ab3c5"
  },
  "name": "Heart_of_the_Hunter",
  "rating": "2.3",
  "video": "https://www.youtube.com/embed/KSCFWJvcYXE",
  "release": "2024",
  "director": "Mandla Walter Dube",
  "info": "The quiet retirement of a once-feared assassin in South Africa is interrupted by a desperate call from the daughter of an old and trusted friend whose father has been kidnapped. He uncovers a conspiracy at the heart of the government."
},
{
  "_id": {
    "$oid": "662df9347d8dd8f8df3ab3c6"
  },
  "name": "Immaculate",
  "rating": "3.0",
  "video": "https://www.youtube.com/embed/ewxS9Z-XXYo",
  "release": "2024",
  "director": "Michael Mohan",
  "info": "An American nun embarks on a new journey when she joins a remote convent in the Italian countryside. However, her warm welcome quickly turns into a living nightmare when she discovers her new home harbours a sinister secret and unspeakable horrors."
},
{
  "_id": {
    "$oid": "662df9e07d8dd8f8df3ab3c7"
  },
  "name": "Justice_League_Warworld",
  "rating": "2.7",
  "video": "https://www.youtube.com/embed/IPDLodUE9gg",
  "release": "2023",
  "director": "Jeff Wamester",
  "info": "Until now, the Justice League has been a loose association of superpowered individuals. But when they are swept away to War World, a place of unending brutal gladiatorial combat, Batman, Superman, Wonder Woman and the others must somehow unite to form an unbeatable resistance able to lead an entire planet to freedom."
},
{
  "_id": {
    "$oid": "662dfa327d8dd8f8df3ab3c8"
  },
  "name": "Knuckles",
  "rating": "3.9",
  "video": "https://www.youtube.com/embed/1kETt59yn6A",
  "release": "2024",
  "director": "Tom Howe",
  "info": "The new live-action series will follow Knuckles (Idris Elba) on a hilarious and action-packed journey of self-discovery as he agrees to train Wade (Adam Pally) as his protégé and teach him the ways of the Echidna warrior. The series takes place between the films SONIC THE HEDGEHOG 2 and SONIC THE HEDGEHOG 3.\r\n\r\nStream Knuckles April 26, exclusively on Paramount+ in the U.S. and Canada.  \r\n\r\nThe series will stream on April 27 in additional Paramount+ territories, and in Japan later in the year."
},
{
  "_id": {
    "$oid": "662dfa887d8dd8f8df3ab3c9"
  },
  "name": "Land_of_Bad",
  "rating": "3.3",
  "video": "https://www.youtube.com/embed/dKcHOR-V1G4",
  "release": "2024",
  "director": "William Eubank",
  "info": "When a Delta Force team is ambushed in enemy territory, a rookie officer refuses to abandon them. Their only hope lies with an Air Force drone pilot as the eyes in the sky during a brutal 48-hour battle for survival"
},
{
  "_id": {
    "$oid": "662dfbbb7d8dd8f8df3ab3ca"
  },
  "name": "Late_Night_With_the_Devil",
  "rating": "3.6",
  "video": "https://www.youtube.com/embed/PcuPANZgv4Q",
  "release": "2023",
  "director": " Cameron Cairnes",
  "info": "In 1977 a live television broadcast goes horribly wrong, unleashing evil into the nation's living rooms."
},
{
  "_id": {
    "$oid": "662dfc0d7d8dd8f8df3ab3cb"
  },
  "name": "Love_Lies_Bleeding",
  "rating": "3.5",
  "video": "https://www.youtube.com/embed/BF_J3-DmiS0",
  "release": "2024",
  "director": "Rose Glass",
  "info": "Lou is a reclusive gym manager who falls hard for Jackie, an ambitious bodybuilder who's heading to Las Vegas to pursue her dream. Their love soon leads to violence as they get pulled deep into the web of Lou's criminal family."
},
{
  "_id": {
    "$oid": "662dfc907d8dd8f8df3ab3cc"
  },
  "name": "Migration",
  "rating": "3.4",
  "video": "https://www.youtube.com/embed/p48tBwQgHYw",
  "release": "2023",
  "director": " Benjamin Renner",
  "info": "This holiday season, Illumination, creators of the blockbuster Minions, Despicable Me, Sing and The Secret Life of Pets comedies, invites you to take flight into the thrill of the unknown with a funny, feathered family vacation like no other in the action-packed new original comedy, Migration.\r\nThe Mallard family is in a bit of rut. While dad Mack is content to keep his family safe paddling around their New England pond forever, mom Pam is eager to shake things up and show their kids—teen son Dax and duckling daughter Gwen—the whole wide world. After a migrating duck family alights on their pond with thrilling tales of far-flung places, Pam persuades Mack to embark on a family trip, via New York City, to tropical Jamaica.\r\nAs the Mallards make their way South for the winter, their well-laid plans quickly go awry. The experience will inspire them to expand their horizons, open themselves up to new friends and accomplish more than they ever thought possible, while teaching them more about each other—and\r\nthemselves—than they ever imagined.\r\nFrom a screenplay by Mike White, the Emmy winning creator of The White Lotus and the screenwriter of School of Rock, the film stars a top-flight comedic cast led by Oscar® and Emmy nominee Kumail\r\nNanjiani (The Big Sick, Eternals) as anxious Mallard dad Mack and Emmy nominee Elizabeth Banks (Hunger Games and Pitch Perfect franchises) as Pam, the Mallards’ daring, quick-witted matriarch.\r\nCaspar Jennings plays Dax, the Mallards’ confident and restless son, and, in her feature film debut, Tresi Gazal plays Gwen, the family’s innocent and lovable daughter."
},
{
  "_id": {
    "$oid": "662dfccf7d8dd8f8df3ab3cd"
  },
  "name": "Monkey_Man",
  "rating": "3.6",
  "video": "https://www.youtube.com/embed/g8zxiB5Qhsc",
  "release": "2024",
  "director": "Dev Patel",
  "info": "Oscar® nominee Dev Patel (Lion, Slumdog Millionaire) achieves an astonishing, tour-de-force feature directing debut with an action thriller about one man’s quest for vengeance against the corrupt leaders who murdered his mother and continue to systemically victimize the poor and powerless.\r\n\r\nInspired by the legend of Hanuman, an icon embodying strength and courage, Monkey Man stars Patel as Kid, an anonymous young man who ekes out a meager living in an underground fight club where, night after night, wearing a gorilla mask, he is beaten bloody by more popular fighters for cash.\r\n\r\nAfter years of suppressed rage, Kid discovers a way to infiltrate the enclave of the city’s sinister elite. As his childhood trauma boils over, his mysteriously scarred hands unleash an explosive campaign of retribution to settle the score with the men who took everything from him.\r\n\r\nPacked with thrilling and spectacular fight and chase scenes, Monkey Man is directed by Dev Patel from his original story and his screenplay with Paul Angunawela and John Collee (Master and Commander: The Far Side of the World)."
},
{
  "_id": {
    "$oid": "662dfd1f7d8dd8f8df3ab3ce"
  },
  "name": "No_Way_Up",
  "rating": "2.3",
  "video": "https://www.youtube.com/embed/e1k1PC0TtmE",
  "release": "2024",
  "director": "Claudio Fäh",
  "info": "NO WAY UP is a high concept combination of disaster movie and survival thriller, as characters from very different backgrounds are thrown together when the plane they’re travelling on crashes into the Pacific Ocean.\r\n\r\nThe stricken airliner comes to rest perilously close to the edge of a bottomless ravine with the surviving passengers and crew trapped in an air pocket. With their air supply rapidly running out, a nightmare fight for survival ensues as dangers from all sides hone-in on them.\r\n"
},
{
  "_id": {
    "$oid": "662dfdbe7d8dd8f8df3ab3cf"
  },
  "name": "Noah's_Ark",
  "rating": "3.4",
  "video": "https://www.youtube.com/embed/WytseuaeFFg",
  "release": "2024",
  "director": "Sergio Machado",
  "info": "Noah's Ark A Musical Adventure is a fun and original take on one of the most iconic and well-known stories of all time, with an endearing combination of humor, charm, and lovable characters. The film follows two mice: Vini, a charismatic poet with terrible stage fright, and Tito, a talented and charming guitarist. When the rains come, only one male and one female of each species is allowed on Noah's Ark. With the help of an ingenious cockroach and fate's good luck, Vini and Tito sneak their way onto the Ark and together avert a showdown among the ships carnivores and plant eaters"
},
{
  "_id": {
    "$oid": "662dfe267d8dd8f8df3ab3d0"
  },
  "name": "One_Day",
  "rating": "4.1",
  "video": "https://www.youtube.com/embed/WlopfWYGBh4",
  "release": "2024",
  "director": " David Nicholls",
  "info": "Emma and Dexter meet for the first time on the night of their graduation. Tomorrow they must go their separate ways."
},
{
  "_id": {
    "$oid": "662dfe637d8dd8f8df3ab3d1"
  },
  "name": "Oppenheimer",
  "rating": "4.2",
  "video": "https://www.youtube.com/embed/uYPbbksJxIg",
  "release": "2023",
  "director": "Christopher Nolan",
  "info": "Written and directed by Christopher Nolan, Oppenheimer is an IMAX®-shot epic thriller that thrusts audiences into the pulse-pounding paradox of the enigmatic man who must risk destroying the world in order to save it. \r\n \r\nThe film stars Cillian Murphy as J. Robert Oppenheimer and Emily Blunt as his wife, biologist and botanist Katherine “Kitty” Oppenheimer. Oscar® winner Matt Damon portrays General Leslie Groves Jr., director of the Manhattan Project, and Robert Downey, Jr. plays Lewis Strauss, a founding commissioner of the U.S. Atomic Energy Commission. \r\n \r\nAcademy Award® nominee Florence Pugh plays psychiatrist Jean Tatlock, Benny Safdie plays theoretical physicist Edward Teller, Michael Angarano plays Robert Serber and Josh Hartnett plays pioneering American nuclear scientist Ernest Lawrence.\r\n \r\nOppenheimer also stars Oscar® winner Rami Malek and reunites Nolan with eight-time Oscar® nominated actor, writer and filmmaker Kenneth Branagh. \r\n \r\nThe cast includes Dane DeHaan (Valerian and the City of a Thousand Planets), Dylan Arnold (Halloween franchise), David Krumholtz (The Ballad of Buster Scruggs), Alden Ehrenreich (Solo: A Star Wars Story) and Matthew Modine (The Dark Knight Rises). \r\n \r\nThe film is based on the Pulitzer Prize-winning book American Prometheus: The Triumph and Tragedy of J. Robert Oppenheimer by Kai Bird and the late Martin J. Sherwin. The film is produced by Emma Thomas, Atlas Entertainment’s Charles Roven and Christopher Nolan."
},
{
  "_id": {
    "$oid": "662dfee47d8dd8f8df3ab3d2"
  },
  "name": "Outsource",
  "rating": "2.3",
  "video": "https://www.youtube.com/embed/9F8QIiVus98",
  "release": "2022",
  "director": "John Stephen Baltazar",
  "info": "A police chief hires an old friend, who is an international spy, to help him search for a wanted suspect in the Philippines. When the chief dies, all evidence points towards the spy, and he must go to extremes to defend himself."
},
{
  "_id": {
    "$oid": "662dff1d7d8dd8f8df3ab3d3"
  },
  "name": "Poor_Things",
  "rating": "4.0",
  "video": "https://www.youtube.com/embed/RlbR5N6veqw",
  "release": "2023",
  "director": "Yorgos Lanthimos",
  "info": "From filmmaker Yorgos Lanthimos and producer Emma Stone comes the incredible tale and fantastical evolution of Bella Baxter (Stone), a young woman brought back to life by the brilliant and unorthodox scientist Dr. Godwin Baxter (Willem Dafoe). Under Baxter’s protection, Bella is eager to learn. Hungry for the worldliness she is lacking, Bella runs off with Duncan Wedderburn (Mark Ruffalo), a slick and debauched lawyer, on a whirlwind adventure across the continents. Free from the prejudices of her times, Bella grows steadfast in her purpose to stand for equality and liberation."
},
{
  "_id": {
    "$oid": "662e00707d8dd8f8df3ab3d4"
  },
  "name": "Rebel_Moon_Part_2_The_Scargiver",
  "rating": "2.6",
  "video": "https://www.youtube.com/embed/UEJuNHOd8Dw",
  "release": "2024",
  "director": "Zack Snyder",
  "info": "REBEL MOON — PART TWO: THE SCARGIVER continues the epic saga of Kora and the surviving warriors as they prepare to sacrifice everything, fighting alongside the brave people of Veldt, to defend a once peaceful village, a newfound homeland for those who have lost their own in the fight against the Motherworld. On the eve of their battle the warriors must face the truths of their own pasts, each revealing why they fight. As the full force of the Realm bears down on the burgeoning rebellion, unbreakable bonds are forged, heroes emerge, and legends are made."
},
{
  "_id": {
    "$oid": "662e00af7d8dd8f8df3ab3d5"
  },
  "name": "Spitfire_Over_Berlin",
  "rating": "1.6",
  "video": "https://www.youtube.com/embed/ljqPi-aVh8M",
  "release": "2022",
  "director": "Callum Burn",
  "info": "August 1944. With the American Eighth Air Force poised to strike over Nazi Germany, British Intelligence learns that they could be flying into a deadly trap. With only hours to spare, Flight Lieutenant Edward Barnes must fly a life and death mission over Berlin in his unarmed Spitfire to obtain photographic evidence and save the lives of 1200 Airmen. \r\n \r\nFeaturing breathtaking aerial footage and a viscerally engaging tale of bravery, heroism and heart-stopping suspense, Spitfire Over Berlin is a cinematic spectacle you cannot miss.\r\n"
},
{
  "_id": {
    "$oid": "662e012e7d8dd8f8df3ab3d6"
  },
  "name": "Stepfather_3",
  "rating": "2.4",
  "video": "https://www.youtube.com/embed/BjPH4WxcUds",
  "release": "1992",
  "director": "Guy Magar",
  "info": "A suspicious youth utilises his computer skills to learn the true identity of the menacing figure romancing his mother."
},
{
  "_id": {
    "$oid": "662e04447d8dd8f8df3ab3d7"
  },
  "name": "XXX",
  "rating": "2.9",
  "video": "https://www.youtube.com/embed/NgPdDDzVhkA",
  "release": "2002",
  "director": "Rob Cohen",
  "info": "Xander Cage, an extreme sports athlete, is hired by the US Government to gather information on an organisation that may just be planning the destruction of the world."
},
{
  "_id": {
    "$oid": "662e04757d8dd8f8df3ab3d8"
  },
  "name": "Woody_Woodpecker",
  "rating": "3.0",
  "video": "https://www.youtube.com/embed/ZYjbfLQDYvg",
  "release": "2018",
  "director": "Walter Lantz ",
  "info": "Animated shorts featuring Woody Woodpecker and based on the series by Walter Lantz."
},
{
  "_id": {
    "$oid": "662e04977d8dd8f8df3ab3d9"
  },
  "name": "Trolls_Band_Together",
  "rating": "3.0",
  "video": "https://www.youtube.com/embed/qZ40Z62tcXM",
  "release": "2023",
  "director": "Walt Dohrn",
  "info": "Poppy discovers that Branch and his four brothers were once part of her favorite boy band. When one of his siblings, Floyd, gets kidnapped by a pair of nefarious villains, Branch and Poppy embark on a harrowing and emotional journey to reunite the other brothers and rescue Floyd from a fate even worse than pop culture obscurity."
},
{
  "_id": {
    "$oid": "662e04f27d8dd8f8df3ab3da"
  },
  "name": "Tigers_ON_The_Rise",
  "rating": "3.5",
  "video": "https://www.youtube.com/embed/LX6QGUH-Wi8",
  "release": "2022",
  "director": "Rob Sullivan",
  "info": "The team celebrates the resurgence of tiger populations and showcases their triumphant return to the wild. As they reclaim their territories, they venture beyond forest reserves, posing challenges for humans and animals alike."
},
{
  "_id": {
    "$oid": "662e056e7d8dd8f8df3ab3db"
  },
  "name": "Tiger",
  "rating": "3.6",
  "video": "https://www.youtube.com/embed/AmrorntYVX0",
  "release": "2023",
  "director": "Park Hoon-jung",
  "info": "\r\nChun Man-duk quits being a hunter after his wife's demise and becomes a herb gatherer. His retirement does not last long after his son is severely wounded by a tiger during a hunt."
},
{
  "_id": {
    "$oid": "662e05b67d8dd8f8df3ab3dc"
  },
  "name": "The_Zone_of_Interest",
  "rating": "3.8",
  "video": "https://www.youtube.com/embed/r-vfg3KkV54",
  "release": "2023",
  "director": "Jonathan Glazer",
  "info": "In 1943, the commandant of Auschwitz, Rudolf Höss, and his wife, Hedwig, strive to build a dream life for their family in a house right next to the concentration and extermination camp he helped create."
},
{
  "_id": {
    "$oid": "662e05e67d8dd8f8df3ab3dd"
  },
  "name": "The_Voyagers",
  "rating": "2.8",
  "video": "https://www.youtube.com/embed/EwJkexUBSeg",
  "release": "2021",
  "director": "Neil Burger",
  "info": "The teenage crew of a multi-generational spaceship finds out that their emotions are being medically suppressed. They stop taking the responsible drug and find themselves plunged into a chaotic abyss."
},
{
  "_id": {
    "$oid": "662e06397d8dd8f8df3ab3de"
  },
  "name": "The_Three_Musketeers_Part_II",
  "rating": "3.3",
  "video": "https://www.youtube.com/embed/FsuJMqePZtg",
  "release": "2023",
  "director": " Martin Bourboulon",
  "info": "Constance Bonacieux is kidnapped before D'Artagnan's very eyes. In a frantic quest to save her, the young musketeer, aided by Athos, Porthos and Aramis, is forced to join forces with the mysterious Milady de Winter."
},
{
  "_id": {
    "$oid": "662e066d7d8dd8f8df3ab3df"
  },
  "name": "The_Good_The_Bad_and_The_Ugly",
  "rating": "4.4",
  "video": "https://www.youtube.com/embed/IFNUGzCOQoI",
  "release": "1966",
  "director": "Sergio Leone",
  "info": "A bounty hunting expedition brings two men together in an uncomfortable alliance while looking for buried treasure. They also battle with a wanted outlaw who wants to settle an old score with them."
},
{
  "_id": {
    "$oid": "662e069a7d8dd8f8df3ab3e0"
  },
  "name": "The_Five",
  "rating": "2.9",
  "video": "https://www.youtube.com/embed/MrDqOFFGaAI",
  "release": "2011",
  "director": "Roger Ailes",
  "info": "A panel of elite experts discusses the latest news updates regarding the current social, economic and political development."
}]